///////////////
// Math 객체 //
///////////////
//

///////////////////////
// 올림, 버림, 반올림 //
//////////////////////
//
Math.ceil(0.1); // 1
Math.floor(0.9); // 0
Math.round(0.5); // 1

//
////////////
// 랜덤값 //
///////////
// 잘안씀
Math.random(); // 0 ~ 1 사이 랜덤값 획득
Math.floor(Math.random() * 10) + 1; // 1 ~ 10

const arr2 = new Uint32Array(10); // 유니크한 랜덤 10개
window.crypto.getRandomValues(arr2);

//
////////////
// 최대값 //
///////////
//
let arr = [1, 2, 3, 4, 5];
Math.max(...arr); // 5, 안의 값중 최대값 출력

//
////////////
// 최소값 //
///////////
//
Math.min(...arr); // 1, 안의 값중 최소값 출력

//
////////////
// 절대값 //
///////////
// 은근 쓰임
Math.abs(-1); // 1
Math.abs(1); // 1
