/////////////////
// String 객체 //
////////////////
//
let str = "문자열";
let str2 = new String("문자열");

//
////////////
// length //
////////////
// 길이 반환
console.log(str.length);

//
/////////////////
// chatAt(key) //
/////////////////
// 해당 인덱스 번호의 문자 반환
console.log(str.charAt(2));

//
////////////////////////////////
// indexOf("문자열", 시작지점) //
///////////////////////////////
// 문자 요소 검색, key값 반환, 해당값이 없으면 -1
console.log(str.indexOf("자열"));

//
////////////////////////
// includes("문자열") //
///////////////////////
// 해당 문자열 존재여부 체크, 공백도 인식함
console.log(str.includes("문자")); // true
console.log(str.includes("PHP")); // false

//
////////////////////////////////////
// replace("바꿀문자", "치환문자") //
///////////////////////////////////
// 문자열을 찾아 지정 문자열로 앞에 하나만 치환, 원본 미변경
str = "이것은 문자열";
console.log(str.replace("문자열", "PHP")); // 이것은 PHP

//
///////////////////////////////////////
// replaceAll("바꿀문자", "치환문자") //
//////////////////////////////////////
// 문자열을 찾아 지정 문자열로 전부 치환, 원본 미변경
// 두번째 값을 비우면 지울수 있음
str = "문자열 이것은 문자열";
console.log(str.replaceAll("문자열", "PHP")); // PHP 이것은 PHP
console.log(str.replaceAll("문자열", "")); //  이것은

//
////////////////////////////////////
// substring("시작번호", "끝번호") //
////////////////////////////////////
// 시작 번호부터 끝번호까지 자름
// 끝번호를 빼면 끝까지 자름
// String.substr()도 있으니 쓰지말 것
str = "문자열 임미당";
console.log(str.substring(0, 3));
console.log(str.substring(4));

//
//////////////////////////////
// split("구분자", 길이제한) //
/////////////////////////////
// 문자열을 기준으로 잘라 배열로 만듬
// 두번째 제한값을 넣는 경우는 거의 없음
str = "짜장,탕슉,짬뽕,라멘,볶밥";
let arrSplit = str.split(",");
console.log(arrSplit);

//
////////////
// trim() //
////////////
// 좌우 공백 제거
// **정말 많이씀
str = "    아 하루 넘짧다    ";
console.log(str.trim());

//
//////////////////////////////////
// toUpperCase(), toLowerCase() //
//////////////////////////////////
// 알파뱃을 대/소문자로 변환
str = "aBcDeFg";
console.log(str.toUpperCase());
console.log(str.toLowerCase());
