<?php

/* #for : 특정 처리 반복 */

    // 1 ~ 5
    for($i = 1;$i <= 9;$i++) {
        echo $i." ";
    }

    echo "\n";

    //-------------//

/* break : 나오면 탈출 */

    // 1 ~ 4
    for($i = 1;$i < 6;$i++) {
        echo $i." ";
        if($i === 4) break;
    }

    echo "\n";
    
    //-------------//

/* continue : 나오면 패스 */
    // 짝수 제외, 홀수 제외는 === 1
    for($i = 1;$i < 6;$i++) {
        if(($i % 2) === 0) continue;
        echo $i." ";
    }

    echo "\n";

    //-------------//

/* 실습 */

    // 구구단 2단
    $gugudan = 2;

    for($i = 1 ; $i < 10 ; $i++){
        echo $gugudan." x ".$i." = ".$gugudan * $i."\n";
    }

    //-------------//
    
/* 다중 for */
    //1,2
    for($i = 1; $i <= 10; $i++){
        echo "바깥: ".$i."\n";

        for($j = 1 ; $j < 3; $j++){
            echo "안쪽: ".$j." ";
        }

        echo "\n";
    }

    // 구구단 전부
    for($i = 2; $i < 10; $i++){
        echo $i."단 | ";

        for($j = 1 ; $j < 10; $j++){
            echo $i." x ".$j." = ".($i * $j);
            if($j !== 9) echo ", ";
        }

        echo "\n";
    }

    //-------------//

/* 실습 */

    // 아래처럼 별을 찍어주세요.
    // 예시)
    // *****
    // *****
    // *****
    // *****
    // *****

    for($i = 0; $i < 5; $i++) {
        // echo "*****";

        for($j = 0; $j < 5; $j++) {
            echo "*";
        }

        echo "\n";
    }

    //-------------//

/* 실습 2 */

    // 아래처럼 별을 찍어주세요.
    // 예시)
    // *
    // **
    // ***
    // ****
    // *****

    for($i = 1; $i < 6; $i++) {
        // echo str_repeat("*", $i)."\n";

        for($j = 0; $j < $i; $j++) {
            echo "*";
        }

        echo "\n";
    }

    //-------------//

/* 실습 3 */

    // 아래처럼 별을 찍어주세요.
    // 예시)
    //     *
    //    **
    //   ***
    //  ****
    // *****

    for ($i = 0; $i < 5; $i++) {
        for ($j = 1; $j < 5-$i; $j++){
            echo " ";
        }

        for ($k = 0; $k < $i+1; $k++){
            echo "*";
        }

        echo "\n";
    }
 